code/tabler/app/controllers/assignments_controller.rb

SELECT * FROM "assignments"
---
  def index
    @assignments = Assignment.all

SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)
---
  def show
    @assignment = Assignment.find(params[:id])

INSERT INTO "assignments" ("name", "created_at", "updated_at") VALUES('Week 6 Quiz', '2010-03-03 01:41:26', '2010-03-03 01:41:26')
---
  def create
    @assignment = Assignment.new(params[:assignment])
    if @assignment.save

SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)
---
  def edit
    @assignment = Assignment.find(params[:id])

SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)
UPDATE "assignments" SET "updated_at" = '2010-03-03 03:56:29', "name" = 'Week 6 Quizz' WHERE "id" = 1
---
  def update
    @assignment = Assignment.find(params[:id])
    if @assignment.update_attributes(params[:assignment])

SELECT * FROM "assignments" WHERE ("assignments"."id" = 5)
DELETE FROM "assignments" WHERE "id" = 5
---
  def destroy
    @assignment = Assignment.find(params[:id])
    @assignment.destroy