code/tabler/app/controllers/grades_controller.rb

SELECT * FROM "grades"
---
  def index
    @grades = Grade.all